# -*- coding:utf-8 -*-
from manager import *

if __name__ == '__main__':
    print(u'''------------------------------------------------------------------------------
                程序:  pixiv爬虫
                网址:  https://www.pixiv.net/
                api:   https://api.imjad.cn/pixiv.md
                版本:  1.5
                作者:  KoiSato
                邮箱:  827188553@qq.com
                首发:  2018-2-8
                最终:  2018-2-22
                环境:  Python 3.6
                IDE:   PyCharm
                说明:  通过调用api, 获取p站图源及其信息, 并指定内容开始下载
                ps:    1、在有默认设置的选项中, 不输入直接回车跳过将选择默认设置或 
                          确认设置, 输入后回车将设置选项
                       2、关于漫画下载, 部分漫画因为标识为图集, 而在选择不下载时,
                          仍会被下载 (api的原因所致)
------------------------------------------------------------------------------''')
    # 传入两个参数, per_page: 每页下载作品数, page: 多少页
    while True:
        getter = Getter(800, 1)
        getter.work()
